IdeaRS.OpenModel.WeldingType
Welding Type

IdeaRS.OpenModel.WeldingType.Manual
Manual welding

IdeaRS.OpenModel.WeldingType.ManualSmallRodDiam
Manual welding using rod solid cross-section with diameter less than 1.4mm

IdeaRS.OpenModel.WeldingType.AutomaticAndMachine
Automatic and machine welding

IdeaRS.OpenModel.WeldingType.Automatic
Automatic welding